In [1]:
import pandas as pd 
import seaborn as sns

In [29]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [7]:
k=[4,6,2,9,87,40,20,55]

In [8]:
pd.Series(k)

0     4
1     6
2     2
3     9
4    87
5    40
6    20
7    55
dtype: int64

In [10]:
import numpy as np

In [13]:
a=np.random.randint(20,50,(5,4))
a

array([[28, 36, 21, 46],
       [45, 42, 46, 35],
       [41, 37, 25, 41],
       [41, 39, 45, 27],
       [48, 42, 35, 47]])

In [14]:
a.ndim

2

In [15]:
pd.Series(a)### in  2d we cant use series

ValueError: Data must be 1-dimensional, got ndarray of shape (5, 4) instead

In [28]:
df1=pd.DataFrame(a,columns=['rollno','age','name','marks'],index=['L1','H2','R3','K4','N5'])
df1

    rollno  age  name  marks
L1      28   36    21     46
H2      45   42    46     35
R3      41   37    25     41
K4      41   39    45     27
N5      48   42    35     47

In [31]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [30]:
df=sns.load_dataset('flights')
df

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [32]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df=sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [35]:
df=sns.load_dataset('taxis')
df

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6428,2019-03-31 09:51:53,2019-03-31 09:55:27,1,0.75,4.5,1.06,0.0,6.36,green,credit card,East Harlem North,Central Harlem North,Manhattan,Manhattan
6429,2019-03-31 17:38:00,2019-03-31 18:34:23,1,18.74,58.0,0.00,0.0,58.80,green,credit card,Jamaica,East Concourse/Concourse Village,Queens,Bronx
6430,2019-03-23 22:55:18,2019-03-23 23:14:25,1,4.14,16.0,0.00,0.0,17.30,green,cash,Crown Heights North,Bushwick North,Brooklyn,Brooklyn
6431,2019-03-04 10:09:25,2019-03-04 10:14:29,1,1.12,6.0,0.00,0.0,6.80,green,credit card,East New York,East Flatbush/Remsen Village,Brooklyn,Brooklyn
6432,2019-03-13 19:31:22,2019-03-13 19:48:02,1,3.85,15.0,3.36,0.0,20.16,green,credit card,Boerum Hill,Windsor Terrace,Brooklyn,Brooklyn

In [36]:
df.shape

(6433, 14)

In [39]:
df.shape[0]

6433

In [40]:
df.shape[1]

14

In [37]:
df.columns

Index(['pickup', 'dropoff', 'passengers', 'distance', 'fare', 'tip', 'tolls',
       'total', 'color', 'payment', 'pickup_zone', 'dropoff_zone',
       'pickup_borough', 'dropoff_borough'],
      dtype='object')

In [41]:
df.columns[0]

'pickup'

In [42]:
df.columns[-1]

'dropoff_borough'

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6433 entries, 0 to 6432
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   pickup           6433 non-null   datetime64[ns]
 1   dropoff          6433 non-null   datetime64[ns]
 2   passengers       6433 non-null   int64
 3   distance         6433 non-null   float64
 4   fare             6433 non-null   float64
 5   tip              6433 non-null   float64
 6   tolls            6433 non-null   float64
 7   total            6433 non-null   float64
 8   color            6433 non-null   object
 9   payment          6389 non-null   object
 10  pickup_zone      6407 non-null   object
 11  dropoff_zone     6388 non-null   object
 12  pickup_borough   6407 non-null   object
 13  dropoff_borough  6388 non-null   object
dtypes: datetime64[ns](2), float64(5), int64(1), object(6)
memory usage: 703.7+ KB

In [38]:
df['color'].unique()

array(['yellow', 'green'], dtype=object)

In [44]:
k=[4,6,2,9,87,40,20,'lucky']

In [45]:
pd.Series(k)

0        4
1        6
2        2
3        9
4       87
5       40
6       20
7    lucky
dtype: object

In [47]:
'2025/01/21'

'2025/01/21'

In [48]:
6433-6407

26

In [49]:
df['color']

0       yellow
1       yellow
2       yellow
3       yellow
4       yellow
         ...
6428     green
6429     green
6430     green
6431     green
6432     green
Name: color, Length: 6433, dtype: object

In [51]:
df['tolls']

0       0.0
1       0.0
2       0.0
3       0.0
4       0.0
       ...
6428    0.0
6429    0.0
6430    0.0
6431    0.0
6432    0.0
Name: tolls, Length: 6433, dtype: float64

In [52]:
df['color'].unique()

array(['yellow', 'green'], dtype=object)

In [57]:
df['color'].value_counts()

color
yellow    5451
green      982
Name: count, dtype: int64

In [53]:
df['payment'].unique()

array(['credit card', 'cash', nan], dtype=object)

In [54]:
df['payment']

0       credit card
1              cash
2       credit card
3       credit card
4       credit card
           ...
6428    credit card
6429    credit card
6430           cash
6431    credit card
6432    credit card
Name: payment, Length: 6433, dtype: object

In [56]:
df['payment'].value_counts()

payment
credit card    4577
cash           1812
Name: count, dtype: int64

In [58]:
6433-(4577+1812)

44

In [60]:
df['fare'].mean()

13.091072594434944

In [61]:
df['fare'].median()

9.5

In [62]:
df['fare'].mode()

0    7.5
Name: fare, dtype: float64

In [63]:
df['fare'].var()

133.4441818095617

In [64]:
df['fare'].std()

11.55180426641491

In [65]:
df['fare'].max()

150.0

In [66]:
df['fare'].min()

1.0

In [ ]:
df.iloc[2:10,